[
  {
    "productId": 1,
    "productName": "Xiaomi Redmi Note 11 Pro+",
    "productCode": "GDN-0011",
    "releaseDate": "October 2021",
    "description": "Finding the best price for the Xiaomi Redmi Note 11 Pro+ is no easy task. Here you will find where to buy the Xiaomi Redmi Note 11 Pro+ at the best price. Prices are continuously tracked in over 140 stores so that you can find a reputable dealer with the best price",
    "price": 328,
    "starRating": 3.2,
    "imageUrl": "assets/images/3.jpeg"
  },
  {
    "productId": 2,
    "productName": "Xiaomi Mi Max 3",
    "productCode": "GDN-0023",
    "releaseDate": "July 2018",
    "description": "Finding the best price for the Xiaomi Mi Max 3 is no easy task. Here you will find where to buy the Xiaomi Mi Max 3 at the best price. Prices are continuously tracked in over 140 stores so that you can find a reputable dealer with the best price",
    "price": 170,
    "starRating": 4,
    "imageUrl": "assets/images/3.jpeg"
  },
  {
    "productId": 3,
    "productName": "Realme GT Neo 2",
    "productCode": "TBX-0048",
    "releaseDate": "September 2021",
    "description": "Finding the best price for the Realme GT Neo 2 is no easy task. Here you will find where to buy the Realme GT Neo 2 at the best price. Prices are continuously tracked in over 140 stores so that you can find a reputable dealer with the best price",
    "price": 350,
    "starRating": 4,
    "imageUrl": "assets/images/3.jpeg"
  },
  {
    "productId": 4,
    "productName": "OnePlus 9 Pro",
    "productCode": "TBX-0022",
    "releaseDate": "March 2021",
    "description": "Finding the best price for the OnePlus 9 Pro is no easy task. Here you will find where to buy the OnePlus 9 Pro at the best price. Prices are continuously tracked in over 140 stores so that you can find a reputable dealer with the best price",
    "price": 595,
    "starRating": 3,
    "imageUrl": "assets/images/3.jpeg"
  },
  {
    "productId": 5,
    "productName": "Xiaomi Civi",
    "productCode": "GMG-0042",
    "releaseDate": "September 2021",
    "description": "Finding the best price for the Xiaomi Civi is no easy task. Here you will find where to buy the Xiaomi Civi at the best price. Prices are continuously tracked in over 140 stores so that you can find a reputable dealer with the best price",
    "price": 367,
    "starRating": 4,
    "imageUrl": "assets/images/3.jpeg"
  }
]
